# pandas 데이터 파악과 조작

**분석할 데이터를 수집(확보)하면 데이터의 특징을 파악하고 다루기 쉽게 변형하는 작업을 수행해야 한다**

# #2. 데이터 조작(가공)

- 데이터 개수 세기 : count(), value_counts()
- 데이터 정렬 : sort_values(), sort_index()
- 데이터 집계 : 합계(sum()), 평균(mean()), 최대(max()), 최소(min()) 등
- 데이터 삭제 : drop(axis=0/1)
- 결측치 처리 : dropna(axis=0/1, subset, inplace)
- 데이터 변경 : 
    - 자료형 변경 : astype()
    - 수치형 데이터를 범주형 데이터로 변경 : 
        - 구간을 지정하여 범주화 : cut(data, bins, labels)
        - 동일한 개수를 갖도록 범주화 : qcut(data, bins_num, labels)
- 행/열에 동일한 함수 적용 : apply()

In [3]:
import numpy as np
import pandas as pd

In [4]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_nod_interactivity='all'

## 1. 데이터 개수 세기(count)

: **데이터 빈도(frequency) 계산**

- **count() 함수** 
    - 시리즈의 경우 빈도 계산
    - 데이터프레임의 경우 각 컬럼 또는 행의 데이터 빈도 계산
    - NaN값은 세지 않음
    

- **value_counts() 함수**
    - 이산형, 범주형 데이터의 범주별 빈도 계산

### 1) count() 적용하여 개수 세기

- 형식 : **Series.count(level=None)**


- 형식 : **DataFrame.count(axis=0, level=None, numeric_only=False)**

    - axis : 0 or 'index', 1 or 'columns' , default 0
    - level : int or str, optinal (multiIndex의 경우)
    - numerical_only : float, int, boolean data만 포함

#### ① Series 데이터에 count() 함수 적용

In [5]:
titanic = pd.read_csv('data/titanic.csv')

In [6]:
titanic.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [7]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
titanic['Survived'].count()

891

In [9]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
titanic.Sex.count()

891

In [11]:
for col in titanic.columns:
    print(f'{col}:{titanic[col].count()}')

PassengerId:891
Survived:891
Pclass:891
Name:891
Sex:891
Age:714
SibSp:891
Parch:891
Ticket:891
Fare:891
Cabin:204
Embarked:889

#### ② 데이터 프레임에 count()함수 적용
- 각 열마다 데이터 개수를 세기 때문에 누락된 부분을 찾을 때 유용

In [12]:
titanic.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

### 2) value_counts()로 범주별 빈도 계산 

- 문자열 값을 갖는 데이터의 경우 **범주별 빈도(비율) 계산**
    - ex. 성별(남,여), 선호도(종다, 보통, 싫다), 혈액형(A,B,O,AB) 등
    
- 수치형 데이터의 값별 빈도 계산


- 형식 : **Series.value_counts(normalize=False, sort=True, ascending=False, bins=None, dropna=True)**
    - normalize : True인 경우 상대빈도 계산
    - sort : 빈도 크기별로 정렬
    - ascending : 오름차순으로 정렬
    - bins : 범주 구간 수 지정
    - dropna : False로 지정되면 NaN를 포함하여 빈도 계산


- 형식 : **DataFrame.value_counts(subset=None, normalize=False, sort=True, ascending=False, dropna=True)**

#### ① 시리즈 데이터에  value_counts() 적용
- 시리즈의 값이 정수, 문자열인 경우 각각의 값이 나온 횟수를 셀 수 있음
- 파라미터 normalize=True 를 사용하면 각 값 및 범주형 데이터의 비율(상대빈도)을 계산
    - 시리즈.value_counts(normalize=True)

In [13]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- 정수형 값을 갖는 시리즈 데이터에 value_counts() 적용

In [14]:
titanic['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [15]:
titanic.Pclass.value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [16]:
titanic.Pclass.value_counts(normalize=True)

Pclass
3    0.551066
1    0.242424
2    0.206510
Name: proportion, dtype: float64

In [17]:
titanic.Pclass.value_counts(ascending=True)

Pclass
2    184
1    216
3    491
Name: count, dtype: int64

- 실수형 값을 갖는 시리즈 데이터에 value_counts() 적용

In [18]:
titanic.Age.value_counts()

Age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [19]:
titanic.Age.value_counts(bins=6)

(13.683, 26.947]    248
(26.947, 40.21]     245
(40.21, 53.473]     100
(0.339, 13.683]      71
(53.473, 66.737]     43
(66.737, 80.0]        7
Name: count, dtype: int64

In [20]:
(80-0.399)/6

13.266833333333333

In [21]:
titanic.Age.value_counts(bins=10, sort=False)

(0.339, 8.378]       54
(8.378, 16.336]      46
(16.336, 24.294]    177
(24.294, 32.252]    169
(32.252, 40.21]     118
(40.21, 48.168]      70
(48.168, 56.126]     45
(56.126, 64.084]     24
(64.084, 72.042]      9
(72.042, 80.0]        2
Name: count, dtype: int64

- 문자열 값을 갖는 시리즈 데이터에 value_counts() 적용

In [22]:
titanic.Sex.value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [23]:
titanic.Sex.value_counts(ascending=True)

Sex
female    314
male      577
Name: count, dtype: int64

In [24]:
titanic.Sex.value_counts(normalize=True)*100

Sex
male      64.758698
female    35.241302
Name: proportion, dtype: float64

#### ② 데이터프레임에  value_counts()  함수 사용

- 행(row)을 하나의 value로 설정하고 동일한 행이 몇 번 나타났는지의 빈도를 Series로 반환

In [25]:
df = pd.DataFrame({'num_legs':[2,4,4,6], 'num_wings':[2,0,0,0]},
                  index=['falicon', 'dog', 'cat', 'ant'])
df

         num_legs  num_wings
falicon         2          2
dog             4          0
cat             4          0
ant             6          0

In [26]:
df.value_counts()

num_legs  num_wings
4         0            2
2         2            1
6         0            1
Name: count, dtype: int64

#### 문제. 타이타닉 데이터에서 Pclass에 따른 생존/사망 빈도 계산

In [27]:
titanic[['Pclass', 'Survived']].value_counts(sort=False)

Pclass  Survived
1       0            80
        1           136
2       0            97
        1            87
3       0           372
        1           119
Name: count, dtype: int64

In [28]:
titanic[['Pclass', 'Survived']].value_counts(normalize=True, sort=False)*100 #퍼센트

Pclass  Survived
1       0            8.978676
        1           15.263749
2       0           10.886644
        1            9.764310
3       0           41.750842
        1           13.355780
Name: proportion, dtype: float64

In [29]:
titanic[['Sex', 'Survived']].value_counts()

Sex     Survived
male    0           468
female  1           233
male    1           109
female  0            81
Name: count, dtype: int64

#### 예. 결측치가 있는 데이터프레임

In [30]:
titanic.Embarked.value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [31]:
titanic.Embarked.value_counts(dropna=False)

Embarked
S      644
C      168
Q       77
NaN      2
Name: count, dtype: int64

----------------------------------

## 2. 데이터 정렬 

- 데이터 정렬을 위한 정렬 함수 사용
- **sort_index()** : 인덱스를 기준으로 정렬
- **sort_value()** : 데이터 값을 기준으로 정렬

### 1) 시리즈 정렬

In [46]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [51]:
titanic.Pclass.value_counts(sort=True)

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [50]:
type(titanic.Pclass.value_counts(sort=True))

pandas.core.series.Series

In [52]:
titanic.Pclass.value_counts().index

Index([3, 1, 2], dtype='int64', name='Pclass')

In [53]:
titanic.Pclass.value_counts().sort_index()

Pclass
1    216
2    184
3    491
Name: count, dtype: int64

In [54]:
titanic.Pclass.value_counts().sort_index(ascending=False)

Pclass
3    491
2    184
1    216
Name: count, dtype: int64

In [55]:
titanic.Pclass.value_counts().values

array([491, 216, 184])

In [59]:
titanic.Pclass.value_counts().sort_values()

Pclass
2    184
1    216
3    491
Name: count, dtype: int64

In [60]:
titanic.Pclass.value_counts().sort_values(ascending=False)

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

### 2) 데이터 프레임 정렬

- **DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', ignore_index=False, key=None)**
    - 특정열 값 기준 정렬
    - 정렬시 기준열을 주어야 함. by 인수 사용(생략 불가)
        - by = 기준열, by=[기준열1,기준열2]
    - 오름차순/내림차순 : ascending = True/False (생략하면 오름차순)
    
    
- **DataFrame.sort_index(axis=0, level=None, ascending=True, inplace=False, kind='quicksort', na_position='last', sort_remaining=True, ignore_index=False, key=None)**
    - DataFrame의 INDEX 기준 정렬
    - 오름차순/내림차순 : ascending = True/False (생략하면 오름차순)

In [61]:
df = pd.DataFrame({'num_legs':[2,4,4,6], 'num_wings':[2,0,0,0]},
                  index=['falicon', 'dog', 'cat', 'ant'])
df

         num_legs  num_wings
falicon         2          2
dog             4          0
cat             4          0
ant             6          0

- 데이터프레임의 값을 기준으로 정렬

In [63]:
df.sort_values(by='num_legs', ascending=False)

         num_legs  num_wings
ant             6          0
dog             4          0
cat             4          0
falicon         2          2

In [66]:
df.sort_values('num_wings', ascending=False)

         num_legs  num_wings
falicon         2          2
dog             4          0
cat             4          0
ant             6          0

In [69]:
df.loc['cat', 'num_wings'] = np.nan
df

         num_legs  num_wings
falicon         2        2.0
dog             4        0.0
cat             4        NaN
ant             6        0.0

In [71]:
df.sort_values('num_wings', ascending=False) #결측치는 맨 뒤로 감 / ascending False로 해도

         num_legs  num_wings
falicon         2        2.0
dog             4        0.0
ant             6        0.0
cat             4        NaN

In [72]:
df.sort_values(['num_legs', 'num_wings'])

         num_legs  num_wings
falicon         2        2.0
dog             4        0.0
cat             4        NaN
ant             6        0.0

- 데이터프레임의 index를 기준으로 정렬

In [73]:
df.sort_index()

         num_legs  num_wings
ant             6        0.0
cat             4        NaN
dog             4        0.0
falicon         2        2.0

In [74]:
df.sort_index(ascending=False)

         num_legs  num_wings
falicon         2        2.0
dog             4        0.0
cat             4        NaN
ant             6        0.0

---------------------------------------------------

### 연습문제

1. 타이타닉 데이터에서 승객의 성별(Sex) 인원수, 나이별(Age) 인원수, 선실별(Pclass) 인원수, 사망/생존(Survived)인원수를 구하시오.

In [111]:
# 데이터 불러오기
titanic = pd.read_csv('data/titanic.csv')

In [75]:
# 데이터 변수 정보 확인
titanic.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [81]:
# 1-1. 타이타닉 승객에 대하여 성별 인원수 구하기
titanic.Sex.value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [112]:
# 1-2. 타이타닉 승객에 대하여 나이별 인원수 구하기
titanic.Age.value_counts(bins=6, sort=False) #bins로 6개 구간으로 나눔

(0.339, 13.683]      71
(13.683, 26.947]    248
(26.947, 40.21]     245
(40.21, 53.473]     100
(53.473, 66.737]     43
(66.737, 80.0]        7
Name: count, dtype: int64

In [114]:
# 1-2. 타이타닉 승객에 대하여 나이별 인원수 구하기
titanic.Age.value_counts(bins=8, sort=False) #bins로 6개 구간으로 나눔

(0.339, 10.368]      64
(10.368, 20.315]    115
(20.315, 30.263]    230
(30.263, 40.21]     155
(40.21, 50.158]      86
(50.158, 60.105]     42
(60.105, 70.052]     17
(70.052, 80.0]        5
Name: count, dtype: int64

In [115]:
# 1-3. 타이타닉 승객에 대하여 선실별 인원수 구하기
titanic.Pclass.value_counts(sort=False)

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [85]:
# 1-4. 타이타닉 승객에 대하여 사망/생존 인원수 구하기
titanic.Survived.value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

2. 성별 인원수는 인덱스 기준으로 정렬하고, 나이별 인원수는 값 기준으로 정렬하시오.

In [116]:
# 2-1. 타이타닉 승객에 대하여 성별 인원수를 인덱스 기준으로 정렬하기
titanic.Sex.value_counts().sort_index()

Sex
female    314
male      577
Name: count, dtype: int64

In [125]:
# 2-2. 타이타닉 승객에 대하여 나이별 인원수를 값 기준으로 정렬하기
titanic.Age.value_counts(bins=6).sort_values()

(66.737, 80.0]        7
(53.473, 66.737]     43
(0.339, 13.683]      71
(40.21, 53.473]     100
(26.947, 40.21]     245
(13.683, 26.947]    248
Name: count, dtype: int64

------------------------------------------------------

## 3. 데이터의 행/열의 집계 및 통계 관련 함수

: 데이터프레임에 적용되는 집계/통계 관련 함수

- 합계 : **sum**(axis=0 또는 1)
    - 각 열의 합계 계산 : axis=0(index) => 기본값
    - 각 행의 합계 계산 : axis=1(column)
    
- 최소값 : **min**(axis=0 또는 1)
- 최대값 : **max**(axis=0 또는 1)    
- 중앙값 : **median**(axis=0 또는 1)
- 평균 : **mean**(axis=0 또는 1)
- 표준편차 : **std**(axis=0 또는 1)
- 상관계수 : **corr**(method='pearson')

**예제 데이터 프레임 생성**

In [126]:
# 예제 DF 생성
# 4행 8열의 데이터프레임 작성, 난수를 발생시키고
# 0-9범위에서 매번 같은 난수 발생되어 반환되도록 설정
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

### 행/열의 합계(sum)

- 시리즈.sum()
- 데이터프레임.sum()

#### 각 행의 합계 계산

In [128]:
df2.iloc[:,0].sum()

24

In [129]:
df2.sum() #axis=0

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [130]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

**각 열의 합계 계산**

In [130]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

### 통계관련 함수

- 최소값 : min()
- 최대값 : max()
- 중앙값 : median()
- 평균 : mean()
- 표준편차 : std()
- 상관계수 : corr()

In [132]:
# 각 컬럼의 평균, 최소값, 최대값
df2.mean() #컬럼별

0    6.00
1    8.25
2    6.25
3    6.00
4    3.75
5    2.50
6    1.25
7    4.00
dtype: float64

In [133]:
df2.min()

0    4
1    7
2    2
3    4
4    0
5    0
6    0
7    1
dtype: int64

In [134]:
df2.max()

0    9
1    9
2    9
3    9
4    9
5    7
6    4
7    7
dtype: int64

In [135]:
# 행의 평균, 최소값, 최대값
df2.mean(axis=1)

0    4.375
1    4.250
2    5.125
3    5.250
dtype: float64

In [136]:
df2.min(axis=1)

0    0
1    2
2    0
3    0
dtype: int64

In [137]:
df2.max(axis=1)

0    9
1    9
2    9
3    9
dtype: int64

In [138]:
# 중앙값(median)
df2.median()

0    5.5
1    8.5
2    7.0
3    5.5
4    3.0
5    1.5
6    0.5
7    4.0
dtype: float64

In [139]:
df2.median(axis=1)

0    5.0
1    4.0
2    6.5
3    6.5
dtype: float64

In [140]:
# 표준편차
df2.std()

0    2.160247
1    0.957427
2    2.986079
3    2.160247
4    4.112988
5    3.109126
6    1.892969
7    2.943920
dtype: float64

In [142]:
# 상관계수 corr(method='pearson') : 데이터프레임 반환 / pearsan 수치형이어야 함

df2.corr()

,0,1,2,3,4,5,6,7
0,1.000000,0.805823,-0.103348,-0.357143,0.937903,-0.545921,-0.081514,-0.838628
1,0.805823,1.000000,-0.495519,-0.805823,0.782992,-0.727860,0.505781,-0.827837
2,-0.103348,-0.495519,1.000000,0.413394,-0.373184,-0.089759,-0.840328,0.606696
3,-0.357143,-0.805823,0.413394,1.000000,-0.262613,0.843696,-0.733625,0.366900
4,0.937903,0.782992,-0.373184,-0.262613,1.000000,-0.299765,0.053517,-0.963526
5,-0.545921,-0.727860,-0.089759,0.843696,-0.299765,1.000000,-0.254864,0.254925
6,-0.081514,0.505781,-0.840328,-0.733625,0.053517,-0.254864,1.000000,-0.299074
7,-0.838628,-0.827837,0.606696,0.366900,-0.963526,0.254925,-0.299074,1.000000

### 데이터프레임의 행/열 추가

- 열추가 : df['새로운열이름'] = 데이터값 (또는 배열)
- 행추가 : df.loc['새로운행이름'] = 데이터값 (또는 배열)

#### 각 행의 합계를 새로운 열로 추가

In [146]:
df2

   0  1  2  3  4  5  6  7  합계
0  5  8  9  5  0  0  1  7  70
1  6  9  2  4  5  2  4  2  68
2  4  7  7  9  1  7  0  6  82
3  9  9  7  6  9  1  0  1  84

In [149]:
df2['합계']= df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  합계
0  5  8  9  5  0  0  1  7  35
1  6  9  2  4  5  2  4  2  34
2  4  7  7  9  1  7  0  6  41
3  9  9  7  6  9  1  0  1  42

In [ ]:
#행/열삭제
#del df2['합계']

#### 각 열의 합계를 새로운 행으로 추가

: loc 인덱서를 사용하여 새로운 행 추가

In [150]:
df2.loc['colTotal']=df2.sum()
df2

           0   1   2   3   4   5  6   7   합계
0          5   8   9   5   0   0  1   7   35
1          6   9   2   4   5   2  4   2   34
2          4   7   7   9   1   7  0   6   41
3          9   9   7   6   9   1  0   1   42
colTotal  24  33  25  24  15  10  5  16  152

In [151]:
del df2['합계']
df2

           0   1   2   3   4   5  6   7
0          5   8   9   5   0   0  1   7
1          6   9   2   4   5   2  4   2
2          4   7   7   9   1   7  0   6
3          9   9   7   6   9   1  0   1
colTotal  24  33  25  24  15  10  5  16

In [153]:
del df2.loc['colTotal']
df2

           0   1   2   3   4   5  6   7
0          5   8   9   5   0   0  1   7
1          6   9   2   4   5   2  4   2
2          4   7   7   9   1   7  0   6
3          9   9   7   6   9   1  0   1
colTotal  24  33  25  24  15  10  5  16

-------------------------------------